//
//  Tab.swift
//  GNURANG
//
//  Created by 하일환 on 2023/03/17.
//

import SwiftUI

/// 커스텀 탭 예정. 물론 시간 남으면... ㅎㅎ
/// 미리 만들어놓기만 하자.

struct TabItem: Identifiable {
    var id = UUID()  // 여긴 UUID인데... 아마 여러개를 enum은 여러개를 만들고 각각 지정해주니까 그런건가..?
    var name: String
    var icon: String
    var tab: Tab
}

enum Tab: String {
    case home, map, check, timetable, user
}

/// 13일차에 가장 힘들었던 부분.
/// 이젠 어디서든 이 값들을 불러올 수 있겠지?

enum Campus: String, CaseIterable, Identifiable {
    case 가좌캠, 칠암캠, 통영캠
    var id: Self { self }
}

enum CafeteriaName: String, CaseIterable, Identifiable {
    case 중앙1식당, 아람관, 교육문화1층식당, 교직원식당
    var id: Self { self } // ? uuid?
}

struct Cafeteria: Identifiable {
    var id = UUID()
    var text: String
    var name: CafeteriaName
    var campus: Campus
    var url: String
    var isLastSeen: Bool
}

var CafeteriaList = [
    Cafeteria(text: "중앙1식당", name: .중앙1식당, campus: .가좌캠, url: "nil", isLastSeen: false),
    Cafeteria(text: "아람관", name: .아람관, campus: .가좌캠, url: "nil", isLastSeen: false),
    Cafeteria(text: "교육문화1층식당", name: .교육문화1층식당, campus: .가좌캠, url: "nil", isLastSeen: false),
    Cafeteria(text: "교직원식당", name: .교직원식당, campus: .가좌캠, url: "nil", isLastSeen: false)
]

enum Notice: String, CaseIterable, Identifiable {
    case 기관, 학사, 장학, 학술, 채용
    var id: Self { self }
}

// enum 단과대학: String, CaseIterable, Identifiable {
//     case 인문대학, 사회과학대학, 자연과학대학, 경영대학, 공과대학, 농업생명과학대학, 법과대학, 사범대학, 수의과대학, 의과대학, 간호대학, 해양과학대학, 약학대학, 본부대학I, 건설환경공과대학, 융합기술공과대학, 본부대학II
//     var id: Self { self }
// }
//
// enum 자연대: String, CaseIterable, Identifiable {
//     case 생명과학부, 물리학과, 수학과, 식품영양학과, 의류학과, 정보통계학과, 제약공학과, 지질과학과, 항노화신소재과학과, 화학과, 컴퓨터과학부_컴퓨터과학전공, 컴퓨터과학부_컴퓨터소프트웨어전공
//     var id: Self { self}
// }

var 단과대학: [String: Array] = [
    "인문대학": ["영어영문학부 영어영문학전공","영어영문학부 영어전공","국어국문학과","독어독문학과","러시아학과","민속무용학과","불어불문학과","사학과","중어중문학과","철학과","한문학과"],
    "사회과학대학": ["경제학부","사회복지학부","사회학과","심리학과","아동가족학과","정치외교학과","행정학과"],
    "자연과학대학": ["생명과학부", "물리학과", "수학과", "식품영양학과", "의류학과", "정보통계학과", "제약공학과", "지질과학과", "항노화신소재과학과", "화학과", "컴퓨터과학부 컴퓨터과학전공", "컴퓨터과학부 컴퓨터소프트웨어전공"],
    "경영대학": ["경영학부","국제통상학부","회계세무학부","경영정보학과","산업경영학과","스마트유통물류학과"],
    "공과대학": ["건축공학부 건축공학전공","건축공학부 건축시스템공학전공","기계공학부","나노ㆍ신소재공학부 고분자공학전공","나노ㆍ신소재공학부 금속재료공학전공","나노ㆍ신소재공학부 세라믹공학전공","산업시스템공학부","항공우주및소프트웨어공학부","건축학과","도시공학과","반도체공학과","전기공학과","전자공학과","제어로봇공학과","토목공학과","화학공학과"],
    "농업생명과학대학": ["식품자원경제학과","동물생명융합학부","식품공학과","원예과학부","축산과학부","환경산림과학부","농학과","스마트농산업학과","식물의학과","환경생명화학과","환경재료과학과","생물산업기계공학과","지역시스템공학과"],
    "법과대학": ["법학과"],
    "사범대학": ["교육학과","국어교육과","역사교육과","영어교육과","유아교육과","윤리교육과","일반사회교육과","일어교육과","지리교육과","물리교육과","생물교육과","수학교육과","화학교육과","미술교육과","음악교육과","체육교육과"],
    "수의과대학": ["수의학과","수의예과"],
    "의과대학": ["의학과","의예과"],
    "간호대학": ["간호대학"],
    "해양과학대학": ["해양수산경영학과","미래산업융합학과","양식생명과학과","해양경찰시스템학과","기계시스템공학과","스마트에너지기계공학과","조선해양공학과","지능형통신공학과","해양식품공학과","해양토목공학과","해양환경공학과"],
    "약학대학": ["약학대학"],
    "본부대학I": ["기계융합공학과"],
    "건설환경공과대학": ["건설시스템공학과","인테리어재료공학과","조경학과","환경공학과","디자인비즈니스학과"],
    "융합기술공과대학": ["기계소재융합공학부","메카트로닉스공학부","융합전자공학부","에너지공학과","미래자동차공학과"],
    "본부대학II": ["휴먼헬스케어학과"]
]
